class Scripts():
    
    PROGRESS_BAR = """\n
<b>» ᴛᴀɪʟʟᴇ</b> : {1} | {2}  
<b>» ꜰᴀɪᴛ</b> : {0}%  
<b>» ᴠɪᴛᴇssᴇ</b> : {3}/s  
<b>» ᴇᴛᴀ</b> : {4}"""

    START_TXT = """
<b>ꜱᴀʟᴜᴛ ! {}  

ᴊᴇ ꜱᴜɪꜱ ʜɪɴᴀᴛᴀ ʜʏᴜɢᴀ, ᴋᴜɴᴏɪᴄʜɪ ᴅᴜ ᴄʟᴀɴ ʜʏᴜɢᴀ ᴇᴛ, ᴀᴜᴊᴏᴜʀᴅ'ʜᴜɪ, ᴠᴏᴛʀᴇ ᴀꜱꜱɪꜱᴛᴀɴᴛᴇ ᴅéᴠᴏᴜéᴇ. 🌀

» ᴛᴏᴜᴛ ᴄᴏᴍᴍᴇ ᴊᴇ ᴘʀᴏᴛèɢᴇ ᴄᴇᴜx ǫᴜɪ ᴍᴇ ꜱᴏɴᴛ ᴄʜᴇʀꜱ ᴀᴠᴇᴄ ᴍᴏɴ ʙʏᴀᴋᴜɢᴀɴ, ᴊᴇ ᴠᴀɪꜱ ᴍ'ᴀꜱꜱᴜʀᴇʀ ǫᴜᴇ ᴠᴏꜱ ꜰɪᴄʜɪᴇʀꜱ ꜱᴏɪᴇɴᴛ ʀᴇɴᴏᴍᴍéꜱ ᴀᴠᴇᴄ ᴘʀéᴄɪꜱɪᴏɴ ᴇᴛ ꜱᴛʏʟᴇ.  
» ᴀᴊᴏᴜᴛᴇᴢ ᴜɴᴇ ʟéɢᴇɴᴅᴇ ᴘᴇʀꜱᴏɴɴᴀʟɪꜱéᴇ, �ᴜɴᴇ ᴍɪɴɪᴀᴛᴜʀᴇ éʟéɢᴀɴᴛᴇ ᴇᴛ ʟᴀɪꜱꜱᴇᴢ-ᴍᴏɪ ꜱéǫᴜᴇɴᴄᴇʀ ᴠᴏꜱ ꜰɪᴄʜɪᴇʀꜱ à ʟᴀ ᴘᴇʀꜰᴇᴄᴛɪᴏɴ.  
</b>
"""
    FILE_NAME_TXT = """<b>» <u>ᴄᴏɴꜰɪɢᴜʀᴇʀ ʟᴇ ꜰᴏʀᴍᴀᴛ ᴅᴇ ʀᴇɴᴏᴍᴍᴀɢᴇ ᴀᴜᴛᴏᴍᴀᴛɪǫᴜᴇ</u></b>

<b>ᴠᴀʀɪᴀʙʟᴇs :</b>
➲ ᴇᴘɪsᴏᴅᴇ - ᴘᴏᴜʀ ʀᴇᴍᴘʟᴀᴄᴇʀ ʟᴇ ɴᴜᴍéʀᴏ ᴅᴇ ʟ'ᴇᴘɪsᴏᴅᴇ  
➲ sᴀɪsᴏɴ - ᴘᴏᴜʀ ʀᴇᴍᴘʟᴀᴄᴇʀ ʟᴇ ɴᴜᴍéʀᴏ ᴅᴇ ʟᴀ sᴀɪsᴏɴ
➲ ǫᴜᴀʟɪᴛʏ - ᴘᴏᴜʀ ʀᴇᴍᴘʟᴀᴄᴇʀ ʟᴀ ǫᴜᴀʟɪᴛé  

<b>‣ ᴘᴀʀ ᴇxᴀᴍᴘʟᴇ :- </b> <code> /autorename Suicide Squad [Ssaison - EPepisode - [Quality] [Dual] @hyoshmangavf </code>

<b>‣ /autorename : ʀᴇɴᴏᴍᴍᴇᴢ ᴠᴏs ꜰɪʟᴇs ᴍᴜʟᴛɪᴍᴇᴅɪᴀ ᴇɴ ɪɴᴄʟᴜᴀɴᴛ ʟᴇs ᴠᴀʀɪᴀʙʟᴇs 'ᴇᴘɪsᴏᴅᴇ' ᴇᴛ 'ǫᴜᴀʟɪᴛé' ᴅᴀɴs vᴏᴛʀᴇ ᴛᴇxᴛᴇ, ᴘᴏᴜʀ ᴇxᴛʀᴀɪʀᴇ ʟ'ᴇᴘɪsᴏᴅᴇ ᴇᴛ ʟᴀ ǫᴜᴀʟɪᴛé ᴘʀésᴇɴᴛs ᴅᴀɴs ʟᴇ ɴᴏᴍ ᴅᴇ ꜰɪʟᴇ ᴏʀɪɢɪɴᴀʟ.</b>"""


    ABOUT_TXT = f"""<b>❍ ᴍᴏɴ ɴᴏᴍ : <a href="https://t.me/hyoshassistantbot">ɢᴇ ᴀᴜᴛᴏ ʀᴇɴᴀᴍᴇ</a>  
❍ ᴅéᴠᴇʟᴏᴘᴘᴇᴜʀ : <a href="https://t.me/hyoshassistantBot">ᴘʀᴏᴘʀɪéᴛᴀɪʀᴇ</a>  
❍ ɢɪᴛʜᴜʙ : <a href="https://github.com/hyoshassistantBot">ᴘʀᴏᴘʀɪéᴛᴀɪʀᴇ</a>  
❍ ʟᴀɴɢᴀɢᴇ : <a href="https://www.python.org/">ᴘʏᴛʜᴏɴ</a>  
❍ ʙᴀsᴇ ᴅᴇ ᴅᴏɴɴéᴇs : <a href="https://www.mongodb.com/">ᴍᴏɴɢᴏᴅʙ</a>  
❍ ʜéʙᴇʀɢé sᴜʀ : <a href="https://t.me/hyoshassistantbot">ᴠᴘs</a>  
❍ ᴄᴀɴᴀʟ ᴘʀɪɴᴄɪᴘᴀʟ : <a href="https://t.me/hyoshmangavf">ᴀɴɪᴍᴇ ᴄʀᴜɪsᴇ</a>  

➻ ᴄʟɪǫᴜᴇᴢ sᴜʀ ʟᴇs ʙᴏᴜᴛᴏɴs ᴄɪ-ᴅᴇssᴏᴜs ᴘᴏᴜʀ ᴏʙᴛᴇɴɪʀ ᴅᴇ ʟ'ᴀɪᴅᴇ ᴇᴛ ᴅᴇs ɪɴғᴏʀᴍᴀᴛɪᴏɴs ʙᴀsɪǫᴜᴇs sᴜʀ ᴍᴏɪ.</b>"""


    THUMBNAIL_TXT = """<b><u>» ᴘᴏᴜʀ ᴅéꜰɪɴɪʀ ᴜɴᴇ ᴍɪɴɪᴀᴛᴜʀᴇ ᴘᴇʀꜱᴏɴɴᴀʟɪꜱéᴇ</u></b>
    
➲ /start : ᴇɴᴠᴏʏᴇᴢ ɴ'ɪᴍᴘᴏʀᴛᴇ ǫᴜᴇʟʟᴇ ᴘʜᴏᴛᴏ ᴘᴏᴜʀ ʟᴀ ᴅéꜰɪɴɪʀ ᴀᴜᴛᴏᴍᴀᴛɪǫᴜᴇᴍᴇɴᴛ ᴄᴏᴍᴍᴇ ᴍɪɴɪᴀᴛᴜʀᴇ.
➲ /del_thumb : ᴜᴛɪʟɪꜱᴇᴢ ᴄᴇᴛᴛᴇ ᴄᴏᴍᴍᴀɴᴅᴇ ᴘᴏᴜʀ ꜱᴜᴘᴘʀɪᴍᴇʀ ᴠᴏᴛʀᴇ ᴀɴᴄɪᴇɴɴᴇ ᴍɪɴɪᴀᴛᴜʀᴇ.
➲ /view_thumb : ᴜᴛɪʟɪꜱᴇᴢ ᴄᴇᴛᴛᴇ ᴄᴏᴍᴍᴀɴᴅᴇ ᴘᴏᴜʀ ᴠᴏɪʀ ᴠᴏᴛʀᴇ ᴍɪɴɪᴀᴛᴜʀᴇ ᴀᴄᴛᴜᴇʟʟᴇ.

ɴᴏᴛᴇ : ꜱɪ ᴀᴜᴄᴜɴᴇ ᴍɪɴɪᴀᴛᴜʀᴇ ɴ'ᴇꜱᴛ ᴇɴʀᴇɢɪꜱᴛʀéᴇ ᴅᴀɴꜱ ʟᴇ ʙᴏᴛ, ʟᴀ ᴍɪɴɪᴀᴛᴜʀᴇ ᴅᴜ ꜰɪᴄʜɪᴇʀ ᴏʀɪɢɪɴᴀʟ ꜱᴇʀᴀ ᴜᴛɪʟɪꜱéᴇ ᴘᴏᴜʀ ʟᴇ ꜰɪᴄʜɪᴇʀ ʀᴇɴᴏᴍᴍé."""

    CAPTION_TXT = """<b><u>» ᴘᴏᴜʀ ᴅéꜰɪɴɪʀ ᴜɴᴇ ʟéɢᴇɴᴅᴇ ᴘᴇʀꜱᴏɴɴᴀʟɪꜱéᴇ ᴇᴛ ʟᴇ ᴛʏᴘᴇ ᴅᴇ ᴍéᴅɪᴀ</u></b>
    
<b>ᴠᴀʀɪᴀʙʟᴇs :</b>         
ᴛᴀɪʟʟᴇ: <code>{filesize}</code>  
ᴅᴜʀéᴇ: <code>{duration}</code>  
ɴᴏᴍ_ꜰɪʟᴇ: <code>{filename}</code>

➲ /set_caption : ᴘᴏᴜʀ ᴅéꜰɪɴɪʀ ᴜɴᴇ ʟéɢᴇɴᴅᴇ ᴘᴇʀꜱᴏɴɴᴀʟɪꜱéᴇ.  
➲ /see_caption : ᴘᴏᴜʀ ᴠᴏɪʀ ᴠᴏᴛʀᴇ ʟéɢᴇɴᴅᴇ ᴘᴇʀꜱᴏɴɴᴀʟɪꜱéᴇ.  
➲ /del_caption : ᴘᴏᴜʀ sᴜᴘᴘʀɪᴍᴇʀ ᴠᴏᴛʀᴇ ʟéɢᴇɴᴅᴇ ᴘᴇʀꜱᴏɴɴᴀʟɪꜱéᴇ.

» ᴘᴀʀ ᴇxᴀᴍᴘʟᴇ :- /set_caption ɴᴏᴍ ᴅᴇ ꜰɪʟᴇ: {filename}"""


    PROGRESS_BAR = """\n
<b>» ᴛᴀɪʟʟᴇ</b> : {1} | {2}  
<b>» ꜰᴀɪᴛ</b> : {0}%  
<b>» ᴠɪᴛᴇssᴇ</b> : {3}/s  
<b>» ᴇᴛᴀ</b> : {4}"""


    DONATE_TXT = """<blockquote>ᴍᴇʀᴄɪ ᴅᴇ ᴍᴏɴᴛʀᴇʀ ᴅᴇ ʟ'ɪɴᴛéʀêᴛ ᴘᴏᴜʀ ʟᴇs ᴅᴏɴs</blockquote>

<b><i>💞 Sɪ ᴠᴏᴜs ᴀɪᴍᴇᴢ ɴᴏᴛʀᴇ ʙᴏᴛ, ɴ'ʜéꜱɪᴛᴇᴢ ᴘᴀs à ꜰᴀɪʀᴇ ᴜɴ ᴅᴏɴ ᴅᴇ ɴ'ɪᴍᴘᴏʀᴛᴇ ǫᴜᴇʟ ᴍᴏɴᴛᴀɴᴛ $10, $20, $50, $100, ᴇᴛᴄ.</i></b>

Lᴇs ᴅᴏɴs sᴏɴᴛ ᴠʀᴀɪᴍᴇɴᴛ ᴀᴘᴘʀéᴄɪéꜱ ᴇᴛ ᴀɪᴅᴇɴᴛ ᴀᴜ ᴅéᴠᴇʟᴏᴘᴘᴇᴍᴇɴᴛ ᴅᴜ ʙᴏᴛ.

<u>Vᴏᴜs ᴘᴏᴜᴠᴇᴢ ᴀʟᴇʀᴛᴇʀ ᴜɴ ᴅᴏɴ </u>

Pᴀʏᴇʀ ɪᴄɪ - <code> @hyoshassistantBot </code>

Sɪ ᴠᴏᴜs ʟᴇ sᴏᴜʜᴀɪᴛᴇᴢ, ᴠᴏᴜs ᴘᴏᴜᴠᴇᴢ ɴᴏᴜs ᴇɴᴠᴏʏᴇʀ ᴅᴇs ᴄᴀᴘᴛᴜʀᴇs ᴅ'éᴄʀᴀɴ
à - @hyoshassistantBot"""


    PREMIUM_TXT = """<b>ᴀᴍéʟɪᴏʀᴇᴢ ɴᴏᴛʀᴇ sᴇʀᴠɪᴄᴇ ᴘʀᴇᴍɪᴜᴍ ᴇᴛ ᴘʀᴏꜰɪᴛᴇᴢ ᴅᴇ ꜰᴏɴᴄᴛɪᴏɴɴᴀʟɪᴛéꜱ ᴇxᴄʟᴜsɪᴠᴇs :
○ Rᴇɴᴏᴍᴍᴀɢᴇ ɪʟʟɪᴍɪᴛé : ʀᴇɴᴏᴍᴍᴇᴢ ᴀᴜᴛᴀɴᴛ ᴅᴇ ꜰɪʟᴇs ǫᴜᴇ ᴠᴏᴜs ʟᴇ sᴏᴜʜᴀɪᴛᴇᴢ sᴀɴs ᴀᴜᴄᴜɴᴇ ʀᴇsᴛʀɪᴄᴛɪᴏɴ.
○ ᴀᴄᴄèꜱ ᴀɴᴛɪᴄɪᴘé : sᴏʏᴇᴢ ʟᴇ ᴘʀᴇᴍɪᴇʀ à ᴛᴇsᴛᴇʀ ᴇᴛ ᴜᴛɪʟɪsᴇʀ ɴᴏs ꜰᴏɴᴄᴛɪᴏɴɴᴀʟɪᴛéꜱ ᴀᴠᴀɴᴄéᴇs ᴀᴠᴀɴᴛ ᴛᴏᴜᴛ ʟᴇ ᴍᴏɴᴅᴇ.

• Uᴛɪʟɪsᴇᴢ /plan ᴘᴏᴜʀ ᴠᴏɪʀ ᴛᴏᴜs ɴᴏs ᴘʟᴀɴs ᴇɴ ᴜɴ ᴇxᴇᴍᴘʟᴇ.

➲ Pʀᴇᴍɪèʀᴇ éᴛᴀᴘᴇ : ᴘᴀʏᴇʀ ʟᴇ ᴍᴏɴᴛᴀɴᴛ ᴄᴏʀʀᴇsᴘᴏɴᴅᴀɴᴛ à ᴠᴏᴛʀᴇ ᴘʟᴀɴ ᴘʀéꜰéʀé à 

➲ Dᴇᴜxɪèᴍᴇ éᴛᴀᴘᴇ : ᴘʀᴇɴᴇᴢ ᴜɴᴇ ᴄᴀᴘᴛᴜʀᴇ ᴅ'éᴄʀᴀɴ ᴅᴇ ᴠᴏᴛʀᴇ ᴘᴀɪᴇᴍᴇɴᴛ ᴇᴛ ᴘᴀʀᴛᴀɢᴇᴢ-ʟᴀ ᴅɪʀᴇᴄᴛᴇᴍᴇɴᴛ ɪᴄɪ : @hyoshassistantBot 

➲ ᴀʟᴛᴇʀɴᴀᴛɪᴠᴇ : ᴏᴜ ᴛéʟéᴄʜᴀʀɢᴇʀ ʟᴀ ᴄᴀᴘᴛᴜʀᴇ ᴅ'éᴄʀᴀɴ ɪᴄɪ ᴇᴛ ʀéᴘᴏɴᴅʀᴇ ᴀᴠᴇᴄ ʟᴀ ᴄᴏᴍᴍᴀɴᴅᴇ /bought.

Vᴏᴛʀᴇ ᴘʟᴀɴ ᴘʀᴇᴍɪᴜᴍ sᴇʀᴀ ᴀᴄᴛɪᴠé ᴀᴘʀèꜱ ᴠéʀɪꜰɪᴄᴀᴛɪᴏɴ.</b>"""


    PREPLANS_TXT = """<b>👋 Sᴀʟᴜᴛ,

🎖️ <u>ᴘʟᴀɴs ᴅɪsᴘᴏɴɪʙʟᴇs</u> :

Tᴀʀɪꜰɪᴄᴀᴛɪᴏɴ :
➜ Pʀᴇᴍɪᴜᴍ ᴍᴇɴsᴜᴇʟ : 3.99$/ᴍᴏɪs
➜ Pʀᴇᴍɪᴜᴍ ǫᴜᴏᴛɪᴅɪᴇɴ : 0.99/ᴊᴏᴜʀ
➜ Pᴏᴜʀ ʟ'ʜéʙᴇʀɢᴇᴍᴇɴᴛ ᴅᴇ ʙᴏᴛ : ᴄᴏɴᴛᴀᴄᴛᴇᴢ @hyoshassistantBot

➲ Pᴀʏᴇʀ ɪᴄɪ - <code> @hyoshassistantBot </code>

‼️Téʟéᴄʜᴀʀɢᴇʀ ʟᴀ ᴄᴀᴘᴛᴜʀᴇ ᴅᴇ ʟ'éᴄʀᴀɴ ᴅᴜ ᴘᴀɪᴇᴍᴇɴᴛ ɪᴄɪ ᴇᴛ ʀéᴘᴏɴᴅʀᴇ ᴀᴠᴇᴄ ʟᴀ ᴄᴏᴍᴍᴀɴᴅᴇ /bought.</b>"""


    HELP_TXT = """<b>Vᴏɪᴄɪ ʟᴇ ᴍᴇɴᴜ ᴅ'ᴀɪᴅᴇ ᴀᴠᴇᴄ ʟᴇs ᴄᴏᴍᴍᴀɴᴅᴇs ɪᴍᴘᴏʀᴛᴀɴᴛᴇs :

Fᴏɴᴄᴛɪᴏɴɴᴀʟɪᴛéꜱ ɪᴍᴘʀᴇꜱꜱɪᴏɴɴᴀɴᴛᴇs🫧

Lᴇ ʙᴏᴛ ᴅᴇ ʀᴇɴᴏᴍᴍᴀɢᴇ ᴇsᴛ ᴜɴ ᴏᴜᴛɪʟ ᴘʀᴀᴛɪǫᴜᴇ ǫᴜɪ ᴠᴏᴜs ᴀɪᴅᴇ à ʀᴇɴᴏᴍᴍᴇʀ ᴇᴛ ɢéʀᴇʀ ᴠᴏs ꜰɪʟᴇs ꜰᴀᴄɪʟᴇᴍᴇɴᴛ.

➲ /autorename : ʀᴇɴᴏᴍᴍᴇʀ ᴀᴜᴛᴏᴍᴀᴛɪǫᴜᴇᴍᴇɴᴛ ᴠᴏs ꜰɪʟᴇs.
➲ /metadata : ᴄᴏᴍᴍᴀɴᴅᴇs ᴘᴏᴜʀ ᴀᴄᴛɪᴠᴇʀ/ᴅéꜱᴀᴄᴛɪᴠᴇʀ ʟᴇs ᴍéᴛᴀᴅᴏɴɴéᴇs.
➲ /help : ᴏʙᴛᴇɴɪʀ ᴅᴇ ʟ'ᴀɪᴅᴇ ʀᴀᴘɪᴅᴇ.
➲ /set_dump : ᴘᴏᴜʀ ᴅéꜰɪɴɪʀ ʟᴇ ᴄʜᴀɴɴᴇʟ à ᴅᴜᴍᴘᴇʀ (ᴏù ᴠᴏs ꜰɪʟᴇs sᴇʀᴏɴᴛ ᴇɴᴠᴏʏéꜱ ᴜɴᴇ ꜰᴏɪꜱ ʀᴇɴᴏᴍᴍéꜱ).

Nʙ: Aꜱꜱᴜʀᴇᴢ-ᴠᴏᴜs ᴅ'ᴀᴄᴛɪᴠᴇʀ ʟᴇ ᴍᴏᴅᴇ ꜱéǫᴜᴇɴᴛɪᴇʟ ᴘᴏᴜʀ ǫᴜᴇ ʟᴇ ʙᴏᴛ ᴘᴜɪꜱꜱᴇ ᴛʀɪᴇʀ ᴇᴛ ᴇɴᴠᴏʏᴇʀ ʟᴇs ꜰɪʟᴇs ᴅᴀɴs ʟᴇ ʙᴏɴ ᴏʀᴅʀᴇ."""


    SEND_METADATA = """
<b>--ᴘᴀʀᴀᴍéᴛʀᴇs ᴅᴇs ᴍéᴛᴀᴅᴏɴɴéᴇs--</b>

➜ /metadata : ᴀᴄᴛɪᴠᴇʀ ᴏᴜ ꜱᴜᴘᴘʀɪᴍᴇʀ ʟᴇs ᴍéᴛᴀᴅᴏɴɴéᴇs.

<b>ᴅéꜱᴄʀɪᴘᴛɪᴏɴ</b> : ʟᴇs ᴍéᴛᴀᴅᴏɴɴéᴇs ᴠᴏɴᴛ ᴍᴏᴅɪꜰɪᴇʀ ʟᴇs ꜰɪʟᴇs ᴠɪᴅéᴏ ᴍᴋᴠ, ʏ ᴄᴏᴍᴘʀᴇɴᴛ ᴛᴏᴜᴛᴇs ʟᴇs ᴛɪᴛʀᴇs ᴀᴜᴅɪᴏ, sᴛʀᴇᴀᴍs ᴇᴛ sᴜʙᴛɪᴛʀᴇs.""" 


    SOURCE_TXT = """
<b>Sᴀʟᴜᴛ,
  Jᴇ sᴜɪs ᴜɴ ʙᴏᴛ ᴅᴇ ʀᴇɴᴏᴍᴍᴀɢᴇ ᴀᴜᴛᴏᴍᴀᴛɪǫᴜᴇ,
ᴜɴ ʙᴏᴛ ᴛᴇʟᴇɢʀᴀᴍ ᴏᴘᴇɴ sᴏᴜʀᴄᴇ ᴅᴇ ʀᴇɴᴏᴍᴍᴀɢᴇ ᴀᴜᴛᴏᴍᴀᴛɪǫᴜᴇ.</b>

Éᴄʀɪᴛ ᴇɴ ᴘʏᴛʜᴏɴ ᴀᴠᴇᴄ ʟ'ᴀɪᴅᴇ ᴅᴇ :
[Pyrogram](https://github.com/pyrogram/pyrogram)
[Python-Telegram-Bot](https://github.com/python-telegram-bot/python-telegram-bot)
ᴇᴛ ᴜᴛɪʟɪsᴀɴᴛ [Mongo](https://cloud.mongodb.com) ᴄᴏᴍᴍᴇ ʙᴀsᴇ ᴅᴇ ᴅᴏɴɴéᴇs.

<b>Vᴏɪᴄɪ ᴍᴏɴ ᴄᴏᴅᴇ sᴏᴜʀᴄᴇ :</b> [GitHub](https://github.com/kalebavincent/autorenamebot)

Lᴇ ʙᴏᴛ ᴅᴇ ʀᴇɴᴏᴍᴍᴀɢᴇ ᴀᴜᴛᴏᴍᴀᴛɪǫᴜᴇ ᴇsᴛ sᴏᴜʀ ʟɪᴄᴇɴᴄᴇ [MIT](https://github.com/kalebavincent/autorenamebot/blob/main/LICENSE).
© 2025 | [Support Chat](https://t.me/tout_manga_confondu), ᴛᴏᴜs ᴅʀᴏɪᴛs ʀéꜱᴇʀᴠéꜱ.
""" 

Txt = Scripts()