class Scripts():
    
    PROGRESS_BAR = """\n
<b>» ᴛᴀɪʟʟᴇ</b> : {1} | {2}  
<b>» ꜰᴀɪᴛ</b> : {0}%  
<b>» ᴠɪᴛᴇssᴇ</b> : {3}/s  
<b>» ᴇᴛᴀ</b> : {4}
"""

    START_TXT = """
<b>ꜱᴀʟᴜᴛ ! {}</b>  

<b>ᴊᴇ ꜱᴜɪꜱ ʜɪɴᴀᴛᴀ ʜʏᴜɢᴀ, ᴋᴜɴᴏɪᴄʜɪ ᴅᴜ ᴄʟᴀɴ ʜʏᴜɢᴀ ᴇᴛ, ᴀᴜᴊᴏᴜʀᴅ'ʜᴜɪ, ᴠᴏᴛʀᴇ ᴀꜱꜱɪꜱᴛᴀɴᴛᴇ ᴅéᴠᴏᴜéᴇ. 🌀</b>

<b>» ᴛᴏᴜᴛ ᴄᴏᴍᴍᴇ ᴊᴇ ᴘʀᴏᴛèɢᴇ ᴄᴇᴜx ǫᴜɪ ᴍᴇ ꜱᴏɴᴛ ᴄʜᴇʀꜱ ᴀᴠᴇᴄ �ᴍᴏɴ ʙʏᴀᴋᴜɢᴀɴ, ᴊᴇ ᴠᴀɪꜱ ᴍ'ᴀꜱꜱᴜʀᴇʀ ǫᴜᴇ ᴠᴏꜱ ꜰɪᴄʜɪᴇʀꜱ ꜱᴏɪᴇɴᴛ ʀᴇɴᴏᴍᴍéꜱ ᴀᴠᴇᴄ ᴘʀéᴄɪꜱɪᴏɴ ᴇᴛ ꜱᴛʏʟᴇ.</b>  
<b>» ᴀᴊᴏᴜᴛᴇᴢ ᴜɴᴇ ʟéɢᴇɴᴅᴇ ᴘᴇʀꜱᴏɴɴᴀʟɪꜱéᴇ, ᴜɴᴇ ᴍɪɴɪᴀᴛᴜʀᴇ éʟéɢᴀɴᴛᴇ ᴇᴛ ʟᴀɪꜱꜱᴇᴢ-ᴍᴏɪ ꜱéǫᴜᴇɴᴄᴇʀ ᴠᴏꜱ ꜰɪᴄʜɪᴇʀꜱ à ʟᴀ ᴘᴇʀꜰᴇᴄᴛɪᴏɴ.</b>
"""

    FILE_NAME_TXT = """
<b>» <u>ᴄᴏɴꜰɪɢᴜʀᴇʀ ʟᴇ ꜰᴏʀᴍᴀᴛ ᴅᴇ ʀᴇɴᴏᴍᴍᴀɢᴇ ᴀᴜᴛᴏᴍᴀᴛɪǫᴜᴇ</u></b>

<b>ᴠᴀʀɪᴀʙʟᴇs :</b>
➲ episode - ᴘᴏᴜʀ ʀᴇᴍᴘʟᴀᴄᴇʀ ʟᴇ ɴᴜᴍéʀᴏ ᴅᴇ ʟ'ᴇᴘɪsᴏᴅᴇ  
➲ saison - ᴘᴏᴜʀ ʀᴇᴍᴘʟᴀᴄᴇʀ ʟᴇ ɴᴜᴍéʀᴏ ᴅᴇ ʟᴀ sᴀɪsᴏɴ  
➲ quality - ᴘᴏᴜʀ ʀᴇᴍᴘʟᴀᴄᴇʀ ʟᴀ ǫᴜᴀʟɪᴛé  

<b>‣ ᴘᴀʀ ᴇxᴀᴍᴘʟᴇ :-</b> <code>/autorename Suicide Squad [Ssaison - EPepisode - [Quality] [Dual] @hyoshmangavf</code>

<b>‣ /autorename :</b> ʀᴇɴᴏᴍᴍᴇᴢ ᴠᴏs ꜰɪʟᴇs ᴍᴜʟᴛɪᴍᴇᴅɪᴀ ᴇɴ ɪɴᴄʟᴜᴀɴᴛ ʟᴇs ᴠᴀʀɪᴀʙʟᴇs 'ᴇᴘɪsᴏᴅᴇ' ᴇᴛ 'ǫᴜᴀʟɪᴛé' ᴅᴀɴs ᴠᴏᴛʀᴇ ᴛᴇxᴛᴇ, ᴘᴏᴜʀ ᴇxᴛʀᴀɪʀᴇ ʟ'ᴇᴘɪsᴏᴅᴇ ᴇᴛ ʟᴀ ǫᴜᴀʟɪᴛé ᴘʀéꜱᴇɴᴛs ᴅᴀɴs ʟᴇ ɴᴏᴍ ᴅᴇ ꜰɪʟᴇ ᴏʀɪɢɪɴᴀʟ.
"""

    ABOUT_TXT = f"""
<b>❍ ᴍᴏɴ ɴᴏᴍ :</b> <a href="https://t.me/hyoshassistantbot">ɢᴇ ᴀᴜᴛᴏ ʀᴇɴᴀᴍᴇ</a>  
<b>❍ ᴅéᴠᴇʟᴏᴘᴘᴇᴜʀ :</b> <a href="https://t.me/hyoshassistantBot">ᴘʀᴏᴘʀɪéᴛᴀɪʀᴇ</a>  
<b>❍ ɢɪᴛʜᴜʙ :</b> <a href="https://github.com/hyoshassistantBot">ᴘʀᴏᴘʀɪéᴛᴀɪʀᴇ</a>  
<b>❍ ʟᴀɴɢᴀɢᴇ :</b> <a href="https://www.python.org/">ᴘʏᴛʜᴏɴ</a>  
<b>❍ ʙᴀsᴇ ᴅᴇ ᴅᴏɴɴéᴇs :</b> <a href="https://www.mongodb.com/">ᴍᴏɴɢᴏᴅʙ</a>  
<b>❍ ʜéʙᴇʀɢé sᴜʀ :</b> <a href="https://t.me/hyoshassistantbot">ᴠᴘs</a>  
<b>❍ ᴄᴀɴᴀʟ ᴘʀɪɴᴄɪᴘᴀʟ :</b> <a href="https://t.me/hyoshmangavf">ᴀɴɪᴍᴇ ᴄʀᴜɪsᴇ</a>  

<b>➻ ᴄʟɪǫᴜᴇᴢ sᴜʀ ʟᴇs ʙᴏᴜᴛᴏɴs ᴄɪ-ᴅᴇssᴏᴜs ᴘᴏᴜʀ ᴏʙᴛᴇɴɪʀ ᴅᴇ ʟ'ᴀɪᴅᴇ ᴇᴛ ᴅᴇs ɪɴғᴏʀᴍᴀᴛɪᴏɴs ʙᴀsɪǫᴜᴇs sᴜʀ ᴍᴏɪ.</b>
"""

    THUMBNAIL_TXT = """
<b><u>» ᴘᴏᴜʀ ᴅéꜰɪɴɪʀ ᴜɴᴇ ᴍɪɴɪᴀᴛᴜʀᴇ ᴘᴇʀꜱᴏɴɴᴀʟɪꜱéᴇ</u></b>

➲ /start : ᴇɴᴠᴏʏᴇᴢ ɴ'ɪᴍᴘᴏʀᴛᴇ ǫᴜᴇʟʟᴇ ᴘʜᴏᴛᴏ ᴘᴏᴜʀ ʟᴀ ᴅéꜰɪɴɪʀ ᴀᴜᴛᴏᴍᴀᴛɪǫᴜᴇᴍᴇɴᴛ ᴄᴏᴍᴍᴇ ᴍɪɴɪᴀᴛᴜʀᴇ.  
➲ /del_thumb : ᴜᴛɪʟɪꜱᴇᴢ ᴄᴇᴛᴛᴇ ᴄᴏᴍᴍᴀɴᴅᴇ ᴘᴏᴜʀ ꜱᴜᴘᴘʀɪᴍᴇʀ ᴠᴏᴛʀᴇ ᴀɴᴄɪᴇɴɴᴇ ᴍɪɴɪᴀᴛᴜʀᴇ.  
➲ /view_thumb : ᴜᴛɪʟɪꜱᴇᴢ ᴄᴇᴛᴛᴇ ᴄᴏᴍᴍᴀɴᴅᴇ ᴘᴏᴜʀ ᴠᴏɪʀ ᴠᴏᴛʀᴇ ᴍɪɴɪᴀᴛᴜʀᴇ ᴀᴄᴛᴜᴇʟʟᴇ.  

<b>ɴᴏᴛᴇ :</b> ꜱɪ ᴀᴜᴄᴜɴᴇ ᴍɪɴɪᴀᴛᴜʀᴇ ɴ'ᴇꜱᴛ ᴇɴʀᴇɢɪꜱᴛʀéᴇ ᴅᴀɴꜱ ʟᴇ ʙᴏᴛ, ʟᴀ ᴍɪɴɪᴀᴛᴜʀᴇ ᴅᴜ ꜰɪʟᴇ ᴏʀɪɢɪɴᴀʟ ꜱᴇʀᴀ ᴜᴛɪʟɪꜱéᴇ ᴘᴏᴜʀ ʟᴇ ꜰɪʟᴇ ʀᴇɴᴏᴍᴍé.
"""

    CAPTION_TXT = """
<b><u>» ᴘᴏᴜʀ ᴅéꜰɪɴɪʀ ᴜɴᴇ ʟéɢᴇɴᴅᴇ ᴘᴇʀꜱᴏɴɴᴀʟɪꜱéᴇ ᴇᴛ ʟᴇ ᴛʏᴘᴇ ᴅᴇ ᴍéᴅɪᴀ</u></b>

<b>ᴠᴀʀɪᴀʙʟᴇs :</b>  
ᴛᴀɪʟʟᴇ: <code>{filesize}</code>  
ᴅᴜʀéᴇ: <code>{duration}</code>  
ɴᴏᴍ_ꜰɪʟᴇ: <code>{filename}</code>  

➲ /set_caption : ᴘᴏᴜʀ ᴅéꜰɪɴɪʀ ᴜɴᴇ ʟéɢᴇɴᴅᴇ ᴘᴇʀꜱᴏɴɴᴀʟɪꜱéᴇ.  
➲ /see_caption : ᴘᴏᴜʀ ᴠᴏɪʀ ᴠᴏᴛʀᴇ ʟéɢᴇɴᴅᴇ ᴘᴇʀꜱᴏɴɴᴀʟɪꜱéᴇ.  
➲ /del_caption : ᴘᴏᴜʀ sᴜᴘᴘʀɪᴍᴇʀ ᴠᴏᴛʀᴇ ʟéɢᴇɴᴅᴇ ᴘᴇʀꜱᴏɴɴᴀʟɪꜱéᴇ.  

<b>» ᴘᴀʀ ᴇxᴀᴍᴘʟᴇ :-</b> <code>/set_caption ɴᴏᴍ ᴅᴇ ꜰɪʟᴇ: {filename}</code>
"""

    DONATE_TXT = """
<blockquote>ᴍᴇʀᴄɪ ᴅᴇ ᴍᴏɴᴛʀᴇʀ ᴅᴇ ʟ'ɪɴᴛéʀêᴛ ᴘᴏᴜʀ ʟᴇs ᴅᴏɴs</blockquote>

<b><i>💞 Sɪ ᴠᴏᴜs ᴀɪᴍᴇᴢ ɴᴏᴛʀᴇ ʙᴏᴛ, ɴ'ʜéꜱɪᴛᴇᴢ ᴘᴀs à ꜰᴀɪʀᴇ ᴜɴ ᴅᴏɴ ᴅᴇ ɴ'ɪᴍᴘᴏʀᴛᴇ ǫᴜᴇʟ ᴍᴏɴᴛᴀɴᴛ $10, $20, $50, $100, ᴇᴛᴄ.</i></b>

<b>Lᴇs ᴅᴏɴs sᴏɴᴛ ᴠʀᴀɪᴍᴇɴᴛ ᴀᴘᴘʀéᴄɪéꜱ ᴇᴛ ᴀɪᴅᴇɴᴛ ᴀᴜ �ᴅéᴠᴇʟᴏᴘᴘᴇᴍᴇɴᴛ ᴅᴜ ʙᴏᴛ.</b>

<u>Vᴏᴜs ᴘᴏᴜᴠᴇᴢ ᴀʟᴇʀᴛᴇʀ ᴜɴ ᴅᴏɴ :</u>  
Pᴀʏᴇʀ ɪᴄɪ - <code>@hyoshassistantBot</code>  

Sɪ ᴠᴏᴜs ʟᴇ sᴏᴜʜᴀɪᴛᴇᴢ, ᴠᴏᴜs ᴘᴏᴜᴠᴇᴢ ɴᴏᴜs ᴇɴᴠᴏʏᴇʀ ᴅᴇs ᴄᴀᴘᴛᴜʀᴇs ᴅ'éᴄʀᴀɴ à - @hyoshassistantBot
"""

    PREMIUM_TXT = """
<b>ᴀᴍéʟɪᴏʀᴇᴢ ɴᴏᴛʀᴇ sᴇʀᴠɪᴄᴇ ᴘʀᴇᴍɪᴜᴍ ᴇᴛ ᴘʀᴏꜰɪᴛᴇᴢ ᴅᴇ ꜰᴏɴᴄᴛɪᴏɴɴᴀʟɪᴛéꜱ ᴇxᴄʟᴜsɪᴠᴇs :</b>  
○ Rᴇɴᴏᴍᴍᴀɢᴇ ɪʟʟɪᴍɪᴛé : ʀᴇɴᴏᴍᴍᴇᴢ ᴀᴜᴛᴀɴᴛ ᴅᴇ ꜰɪʟᴇs ǫᴜᴇ ᴠᴏᴜs ʟᴇ sᴏᴜʜᴀɪᴛᴇᴢ sᴀɴs ᴀᴜᴄᴜɴᴇ ʀᴇsᴛʀɪᴄᴛɪᴏɴ.  
○ ᴀᴄᴄèꜱ ᴀɴᴛɪᴄɪᴘé : sᴏʏᴇᴢ ʟᴇ ᴘʀᴇᴍɪᴇʀ à ᴛᴇsᴛᴇʀ ᴇᴛ ᴜᴛɪʟɪsᴇʀ ɴᴏs ꜰᴏɴᴄᴛɪᴏɴɴᴀʟɪᴛéꜱ ᴀᴠᴀɴᴄéᴇs ᴀᴠᴀɴᴛ ᴛᴏᴜᴛ ʟᴇ ᴍᴏɴᴅᴇ.  

<b>• Uᴛɪʟɪsᴇᴢ /plan ᴘᴏᴜʀ ᴠᴏɪʀ ᴛᴏᴜs ɴᴏs ᴘʟᴀɴs ᴇɴ ᴜɴ ᴇxᴇᴍᴘʟᴇ.</b>  

➲ Pʀᴇᴍɪèʀᴇ éᴛᴀᴘᴇ : ᴘᴀʏᴇʀ ʟᴇ ᴍᴏɴᴛᴀɴᴛ ᴄᴏʀʀᴇsᴘᴏɴᴅᴀɴᴛ à ᴠᴏᴛʀᴇ ᴘʟᴀɴ ᴘʀéꜰéʀé à  
➲ Dᴇᴜxɪèᴍᴇ éᴛᴀᴘᴇ : ᴘʀᴇɴᴇᴢ ᴜɴᴇ ᴄᴀᴘᴛᴜʀᴇ ᴅ'éᴄʀᴀɴ ᴅᴇ ᴠᴏᴛʀᴇ ᴘᴀɪᴇᴍᴇɴᴛ ᴇᴛ ᴘᴀʀᴛᴀɢᴇᴢ-ʟᴀ ᴅɪʀᴇᴄᴛᴇᴍᴇɴᴛ ɪᴄɪ : @hyoshassistantBot  
➲ ᴀʟᴛᴇʀɴᴀᴛɪᴠᴇ : ᴏᴜ ᴛéʟéᴄʜᴀʀɢᴇʀ ʟᴀ ᴄᴀᴘᴛᴜʀᴇ ᴅ'éᴄʀᴀɴ ɪᴄɪ ᴇᴛ ʀéᴘᴏɴᴅʀᴇ ᴀᴠᴇᴄ ʟᴀ ᴄᴏᴍᴍᴀɴᴅᴇ /bought.  

<b>Vᴏᴛʀᴇ ᴘʟᴀɴ ᴘʀᴇᴍɪᴜᴍ sᴇʀᴀ ᴀᴄᴛɪᴠé ᴀᴘʀèꜱ ᴠéʀɪꜰɪᴄᴀᴛɪᴏɴ.</b>
"""

    PREPLANS_TXT = """
<b>👋 Sᴀʟᴜᴛ,</b>

<b>🎖️ <u>ᴘʟᴀɴs ᴅɪsᴘᴏɴɪʙʟᴇs</u> :</b>

<b>Tᴀʀɪꜰɪᴄᴀᴛɪᴏɴ :</b>  
➜ Pʀᴇᴍɪᴜᴍ ᴍᴇɴsᴜᴇʟ : 3.99$/ᴍᴏɪs  
➜ Pʀᴇᴍɪᴜᴍ ǫᴜᴏᴛɪᴅɪᴇɴ : 0.99/ᴊᴏᴜʀ  
➜ Pᴏᴜʀ ʟ'ʜéʙᴇʀɢᴇᴍᴇɴᴛ ᴅᴇ ʙᴏᴛ : ᴄᴏɴᴛᴀᴄᴛᴇᴢ @hyoshassistantBot  

<b>➲ Pᴀʏᴇʀ ɪᴄɪ -</b> <code>@hyoshassistantBot</code>  

<b>‼️Téʟéᴄʜᴀʀɢᴇʀ ʟᴀ ᴄᴀᴘᴛᴜʀᴇ ᴅᴇ ʟ'éᴄʀᴀɴ ᴅᴜ ᴘᴀɪᴇᴍᴇɴᴛ ɪᴄɪ ᴇᴛ ʀéᴘᴏɴᴅʀᴇ ᴀᴠᴇᴄ ʟᴀ ᴄᴏᴍᴍᴀɴᴅᴇ /bought.</b>
"""

    HELP_TXT = """
<b>Vᴏɪᴄɪ ʟᴇ ᴍᴇɴᴜ ᴅ'ᴀɪᴅᴇ ᴀᴠᴇᴄ ʟᴇs ᴄᴏᴍᴍᴀɴᴅᴇs ɪᴍᴘᴏʀᴛᴀɴᴛᴇs :</b>

<b>Fᴏɴᴄᴛɪᴏɴɴᴀʟɪᴛéꜱ ɪᴍᴘʀᴇꜱꜱɪᴏɴɴᴀɴᴛᴇs🫧</b>

<b>Lᴇ ʙᴏᴛ ᴅᴇ ʀᴇɴᴏᴍᴍᴀɢᴇ ᴇsᴛ ᴜɴ ᴏᴜᴛɪʟ ᴘʀᴀᴛɪǫᴜᴇ ǫᴜɪ ᴠᴏᴜs ᴀɪᴅᴇ à ʀᴇɴᴏᴍᴍᴇʀ ᴇᴛ ɢéʀᴇʀ ᴠᴏs ꜰɪʟᴇs ꜰᴀᴄɪʟᴇᴍᴇɴᴛ.</b>

➲ /autorename : ʀᴇɴᴏᴍᴍᴇʀ ᴀᴜᴛᴏᴍᴀᴛɪǫᴜᴇᴍᴇɴᴛ ᴠᴏs ꜰɪʟᴇs.  
➲ /metadata : ᴄᴏᴍᴍᴀɴᴅᴇs ᴘᴏᴜʀ ᴀᴄᴛɪᴠᴇʀ/ᴅéꜱᴀᴄᴛɪᴠᴇʀ ʟᴇs ᴍéᴛᴀᴅᴏɴɴéᴇs.  
➲ /help : ᴏʙᴛᴇɴɪʀ ᴅᴇ ʟ'ᴀɪᴅᴇ ʀᴀᴘɪᴅᴇ.  
➲ /set_dump : ᴘᴏᴜʀ ᴅéꜰɪɴɪʀ ʟᴇ ᴄʜᴀɴɴᴇʟ à ᴅᴜᴍᴘᴇʀ (ᴏù ᴠᴏs ꜰɪʟᴇs sᴇʀᴏɴᴛ ᴇɴᴠᴏʏéꜱ ᴜɴᴇ ꜰᴏɪꜱ ʀᴇɴᴏᴍᴍéꜱ).  

<b>Nʙ:</b> Aꜱꜱᴜʀᴇᴢ-ᴠᴏᴜs ᴅ'ᴀᴄᴛɪᴠᴇʀ ʟᴇ ᴍᴏᴅᴇ ꜱéǫᴜᴇɴᴛɪᴇʟ ᴘᴏᴜʀ ǫᴜᴇ ʟᴇ ʙᴏᴛ ᴘᴜɪꜱꜱᴇ ᴛʀɪᴇʀ ᴇᴛ ᴇɴᴠᴏʏᴇʀ ʟᴇs ꜰɪʟᴇs ᴅᴀɴs ʟᴇ ʙᴏɴ ᴏʀᴅʀᴇ.
"""

    SEND_METADATA = """
<b>--ᴘᴀʀᴀᴍéᴛʀᴇs ᴅᴇs ᴍéᴛᴀᴅᴏɴɴéᴇs--</b>

➜ /metadata : ᴀᴄᴛɪᴠᴇʀ ᴏᴜ ꜱᴜᴘᴘʀɪᴍᴇʀ ʟᴇs ᴍéᴛᴀᴅᴏɴɴéᴇs.

<b>ᴅéꜱᴄʀɪᴘᴛɪᴏɴ :</b> ʟᴇs ᴍéᴛᴀᴅᴏɴɴéᴇs ᴠᴏɴᴛ ᴍᴏᴅɪꜰɪᴇʀ ʟᴇs ꜰɪʟᴇs ᴠɪᴅéᴏ ᴍᴋᴠ, ʏ ᴄᴏᴍᴘʀᴇɴᴛ ᴛᴏᴜᴛᴇs ʟᴇs ᴛɪᴛʀᴇs ᴀᴜᴅɪᴏ, sᴛʀᴇᴀᴍs ᴇᴛ sᴜʙᴛɪᴛʀᴇs.
"""

    SOURCE_TXT = """
<b>Sᴀʟᴜᴛ,</b>  
<b>Jᴇ sᴜɪs ᴜɴ ʙᴏᴛ ᴅᴇ ʀᴇɴᴏᴍᴍᴀɢᴇ ᴀᴜᴛᴏᴍᴀᴛɪǫᴜᴇ,</b>  
<b>ᴜɴ ʙᴏᴛ ᴛᴇʟᴇɢʀᴀᴍ ᴏᴘᴇɴ sᴏᴜʀᴄᴇ ᴅᴇ ʀᴇɴᴏᴍᴍᴀɢᴇ ᴀᴜᴛᴏᴍᴀᴛɪǫᴜᴇ.</b>  

<b>Éᴄʀɪᴛ ᴇɴ ᴘʏᴛʜᴏɴ ᴀᴠᴇᴄ ʟ'ᴀɪᴅᴇ ᴅᴇ :</b>  
[Pyrogram](https://github.com/pyrogram/pyrogram)  
[Python-Telegram-Bot](https://github.com/python-telegram-bot/python-telegram-bot)  
<b>ᴇᴛ ᴜᴛɪʟɪsᴀɴᴛ [Mongo](https://cloud.mongodb.com) ᴄᴏᴍᴍᴇ ʙᴀsᴇ ᴅᴇ ᴅᴏɴɴéᴇs.</b>  

<b>Vᴏɪᴄɪ ᴍᴏɴ ᴄᴏᴅᴇ sᴏᴜʀᴄᴇ :</b> [GitHub](https://github.com/kalebavincent/autorenamebot)  

<b>Lᴇ ʙᴏᴛ ᴅᴇ ʀᴇɴᴏᴍᴍᴀɢᴇ ᴀᴜᴛᴏᴍᴀᴛɪǫᴜᴇ ᴇsᴛ sᴏᴜʀ ʟɪᴄᴇɴᴄᴇ [MIT](https://github.com/kalebavincent/autorenamebot/blob/main/LICENSE).</b>  
<b>© 2025 | [Support Chat](https://t.me/tout_manga_confondu), ᴛᴏᴜs ᴅʀᴏɪᴛs ʀéꜱᴇʀᴠéꜱ.</b>
"""

Txt = Scripts()